app/views/devise/registrations/edit.html.erb

SELECT "cities".* FROM "cities"
---
      <%= f.label :city_id %>
      <%= f.collection_select :city_id, City.all, :id, :name, { prompt: 'Select city' }, :class => 'form-control' %>