app/views/visitors/index.html.erb

<h3>Welcome <%= javascript_tag "welcome_alert('#{current_user.name}')" if current_user %></h3>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM "users"