app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "cities"
---
  def index
    @cities = City.all.paginate(page: params[:page], per_page: 5)

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kraków"], ["short_name", "KRK"], ["created_at", "2015-02-27 12:44:39.329004"], ["updated_at", "2015-02-27 12:44:39.329004"]]
---
  def create
    @city = City.new(city_params)

    if @city.save

UPDATE "cities" SET "name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["name", "Krakóww"], ["updated_at", "2015-02-27 12:54:56.398533"], ["id", 1]]
---
  def update
    if @city.update(city_params)